; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	spectrograph2 - mode
	image5 - mode
	thermograph4 - mode
	image6 - mode
	spectrograph1 - mode
	infrared3 - mode
	spectrograph0 - mode
	Star2 - direction
	Star4 - direction
	Star5 - direction
	Star1 - direction
	GroundStation6 - direction
	GroundStation3 - direction
	GroundStation0 - direction
	Phenomenon7 - direction
	Planet8 - direction
	Star9 - direction
	Planet10 - direction
	Phenomenon11 - direction
	Planet12 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 GroundStation6)
	(supports instrument1 spectrograph1)
	(supports instrument1 image6)
	(supports instrument1 spectrograph0)
	(supports instrument1 spectrograph2)
	(calibration_target instrument1 Star1)
	(calibration_target instrument1 GroundStation0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet12)
	(supports instrument2 image5)
	(supports instrument2 spectrograph1)
	(supports instrument2 thermograph4)
	(calibration_target instrument2 GroundStation6)
	(calibration_target instrument2 GroundStation3)
	(supports instrument3 thermograph4)
	(supports instrument3 infrared3)
	(calibration_target instrument3 GroundStation0)
	(calibration_target instrument3 GroundStation3)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon7)
)
(:goal (and
	(pointing satellite1 GroundStation3)
	(have_image Phenomenon7 spectrograph2)
	(have_image Phenomenon7 image5)
	(have_image Planet8 spectrograph1)
	(have_image Star9 spectrograph1)
	(have_image Planet10 image6)
	(have_image Phenomenon11 infrared3)
	(have_image Phenomenon11 spectrograph1)
	(have_image Planet12 infrared3)
	(have_image Planet12 thermograph4)
))

)

; plan
1. (turn_to satellite1 groundstation3 phenomenon7)
   deleted: (pointing satellite1 phenomenon7)
   added: (pointing satellite1 groundstation3)
   goals met: 1 of 10
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 1 of 10
3. (calibrate satellite1 instrument2 groundstation3)
   added: (calibrated instrument2)
   goals met: 1 of 10
4. (turn_to satellite1 phenomenon7 groundstation3)
   deleted: (pointing satellite1 groundstation3)
   added: (pointing satellite1 phenomenon7)
   goals met: 0 of 10
5. (take_image satellite1 phenomenon7 instrument2 image5)
   added: (have_image phenomenon7 image5)
   goals met: 1 of 10
6. (turn_to satellite1 groundstation0 phenomenon7)
   deleted: (pointing satellite1 phenomenon7)
   added: (pointing satellite1 groundstation0)
   goals met: 1 of 10
7. (turn_to satellite0 groundstation0 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 groundstation0)
   goals met: 1 of 10
8. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 1 of 10
9. (switch_off instrument2 satellite1)
   deleted: (power_on instrument2)
   added: (power_avail satellite1)
   goals met: 1 of 10
10. (calibrate satellite0 instrument1 groundstation0)
   added: (calibrated instrument1)
   goals met: 1 of 10
11. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 1 of 10
12. (calibrate satellite1 instrument3 groundstation0)
   added: (calibrated instrument3)
   goals met: 1 of 10
13. (turn_to satellite0 phenomenon11 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 phenomenon11)
   goals met: 1 of 10
14. (take_image satellite0 phenomenon11 instrument1 spectrograph1)
   added: (have_image phenomenon11 spectrograph1)
   goals met: 2 of 10
15. (turn_to satellite0 phenomenon7 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 phenomenon7)
   goals met: 2 of 10
16. (take_image satellite0 phenomenon7 instrument1 spectrograph2)
   added: (have_image phenomenon7 spectrograph2)
   goals met: 3 of 10
17. (turn_to satellite0 planet10 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 planet10)
   goals met: 3 of 10
18. (take_image satellite0 planet10 instrument1 image6)
   added: (have_image planet10 image6)
   goals met: 4 of 10
19. (turn_to satellite0 planet8 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 planet8)
   goals met: 4 of 10
20. (take_image satellite0 planet8 instrument1 spectrograph1)
   added: (have_image planet8 spectrograph1)
   goals met: 5 of 10
21. (turn_to satellite0 star9 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 star9)
   goals met: 5 of 10
22. (take_image satellite0 star9 instrument1 spectrograph1)
   added: (have_image star9 spectrograph1)
   goals met: 6 of 10
23. (turn_to satellite1 phenomenon11 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 phenomenon11)
   goals met: 6 of 10
24. (take_image satellite1 phenomenon11 instrument3 infrared3)
   added: (have_image phenomenon11 infrared3)
   goals met: 7 of 10
25. (turn_to satellite1 planet12 phenomenon11)
   deleted: (pointing satellite1 phenomenon11)
   added: (pointing satellite1 planet12)
   goals met: 7 of 10
26. (take_image satellite1 planet12 instrument3 infrared3)
   added: (have_image planet12 infrared3)
   goals met: 8 of 10
27. (take_image satellite1 planet12 instrument3 thermograph4)
   added: (have_image planet12 thermograph4)
   goals met: 9 of 10
28. (turn_to satellite1 groundstation3 planet12)
   deleted: (pointing satellite1 planet12)
   added: (pointing satellite1 groundstation3)
   goals met: 10 of 10
